YZ-Qiu/Scope_STM32/Src/ui/gui.c
	// Create label widget: Y_A_Label
	wi.g.show = TRUE;
	wi.g.x = 230;
	wi.g.y = 0;
	wi.g.width = 10;
	wi.g.height = 15;
	wi.g.parent = ghContainerPage0;
	wi.text = "A:";
	wi.customDraw = gwinLabelDrawJustifiedLeft;
	wi.customParam = 0;
	wi.customStyle = &y;
	Y_A_Label = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(Y_A_Label, FALSE);
	gwinSetFont(Y_A_Label, dejavu_sans_10);
	gwinRedraw(Y_A_Label);

	// Create label widget: Y_B_Label
	wi.g.show = TRUE;
	wi.g.x = 230;
	wi.g.y = 15;
	wi.g.width = 10;
	wi.g.height = 15;
	wi.g.parent = ghContainerPage0;
	wi.text = "B:";
	wi.customDraw = gwinLabelDrawJustifiedLeft;
	wi.customParam = 0;
	wi.customStyle = &y;
	Y_B_Label = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(Y_B_Label, FALSE);
	gwinSetFont(Y_B_Label, dejavu_sans_10);
	gwinRedraw(Y_B_Label);

	// Create label widget: X_F_Label
	wi.g.show = TRUE;
	wi.g.x = 170;
	wi.g.y = 0;
	wi.g.width = 10;
	wi.g.height = 15;
	wi.g.parent = ghContainerPage0;
	wi.text = "F:";
	wi.customDraw = gwinLabelDrawJustifiedLeft;
	wi.customParam = 0;
	wi.customStyle = &x;
	X_F_Label = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(X_F_Label, FALSE);
	gwinSetFont(X_F_Label, dejavu_sans_10);
	gwinRedraw(X_F_Label);

	// Create label widget: X_AB_Label
	wi.g.show = TRUE;
	wi.g.x = 170;
	wi.g.y = 15;
	wi.g.width = 20;
	wi.g.height = 15;
	wi.g.parent = ghContainerPage0;
	wi.text = "A-B:";
	wi.customDraw = gwinLabelDrawJustifiedLeft;
	wi.customParam = 0;
	wi.customStyle = &x;
	X_AB_Label = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(X_AB_Label, FALSE);
	gwinSetFont(X_AB_Label, dejavu_sans_10);
	gwinRedraw(X_AB_Label);

	// Create label widget: Y_AB_Label
	wi.g.show = TRUE;
	wi.g.x = 270;
	wi.g.y = 0;
	wi.g.width = 20;
	wi.g.height = 15;
	wi.g.parent = ghContainerPage0;
	wi.text = "A-B:";
	wi.customDraw = gwinLabelDrawJustifiedLeft;
	wi.customParam = 0;
	wi.customStyle = &y;
	Y_AB_Label = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(Y_AB_Label, FALSE);
	gwinSetFont(Y_AB_Label, dejavu_sans_10);
	gwinRedraw(Y_AB_Label);

	// Create label widget: Y_Trg_Label
	wi.g.show = TRUE;
	wi.g.x = 270;
	wi.g.y = 15;
	wi.g.width = 20;
	wi.g.height = 15;
	wi.g.parent = ghContainerPage0;
	wi.text = "Trg:";
	wi.customDraw = gwinLabelDrawJustifiedLeft;
	wi.customParam = 0;
	wi.customStyle = &trg;
	Y_Trg_Label = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(Y_Trg_Label, FALSE);
	gwinSetFont(Y_Trg_Label, dejavu_sans_10);
	gwinRedraw(Y_Trg_Label);

	// Create label widget: CH1_RMS_Label
	wi.g.show = TRUE;
	wi.g.x = 40;
	wi.g.y = 200;
	wi.g.width = 25;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = "RMS:";
	wi.customDraw = gwinLabelDrawJustifiedLeft;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_RMS_Label = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_RMS_Label, FALSE);
	gwinSetFont(CH1_RMS_Label, dejavu_sans_10);
	gwinRedraw(CH1_RMS_Label);

	// Create label widget: CH1_SF_Label
	wi.g.show = TRUE;
	wi.g.x = 40;
	wi.g.y = 210;
	wi.g.width = 20;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = "SF:";
	wi.customDraw = gwinLabelDrawJustifiedLeft;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_SF_Label = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_SF_Label, FALSE);
	gwinSetFont(CH1_SF_Label, dejavu_sans_10);
	gwinRedraw(CH1_SF_Label);

	// Create label widget: CH1_Max_Label
	wi.g.show = TRUE;
	wi.g.x = 110;
	wi.g.y = 200;
	wi.g.width = 25;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = "Max:";
	wi.customDraw = gwinLabelDrawJustifiedLeft;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_Max_Label = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_Max_Label, FALSE);
	gwinSetFont(CH1_Max_Label, dejavu_sans_10);
	gwinRedraw(CH1_Max_Label);

	// Create label widget: CH1_PP_Label
	wi.g.show = TRUE;
	wi.g.x = 180;
	wi.g.y = 200;
	wi.g.width = 15;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = "PP:";
	wi.customDraw = gwinLabelDrawJustifiedLeft;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_PP_Label = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_PP_Label, FALSE);
	gwinSetFont(CH1_PP_Label, dejavu_sans_10);
	gwinRedraw(CH1_PP_Label);

	// Create label widget: CH1_RT_Label
	wi.g.show = TRUE;
	wi.g.x = 250;
	wi.g.y = 200;
	wi.g.width = 15;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = "RT:";
	wi.customDraw = gwinLabelDrawJustifiedLeft;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_RT_Label = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_RT_Label, FALSE);
	gwinSetFont(CH1_RT_Label, dejavu_sans_10);
	gwinRedraw(CH1_RT_Label);

	// Create label widget: CH1_Min_Label
	wi.g.show = TRUE;
	wi.g.x = 110;
	wi.g.y = 210;
	wi.g.width = 25;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = "Min:";
	wi.customDraw = gwinLabelDrawJustifiedLeft;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_Min_Label = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_Min_Label, FALSE);
	gwinSetFont(CH1_Min_Label, dejavu_sans_10);
	gwinRedraw(CH1_Min_Label);

	// Create label widget: CH1_Pk_Label
	wi.g.show = TRUE;
	wi.g.x = 180;
	wi.g.y = 210;
	wi.g.width = 15;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = "Pk:";
	wi.customDraw = gwinLabelDrawJustifiedLeft;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_Pk_Label = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_Pk_Label, FALSE);
	gwinSetFont(CH1_Pk_Label, dejavu_sans_10);
	gwinRedraw(CH1_Pk_Label);

	// Create label widget: CH1_P_Label
	wi.g.show = TRUE;
	wi.g.x = 250;
	wi.g.y = 210;
	wi.g.width = 10;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = "P:";
	wi.customDraw = gwinLabelDrawJustifiedLeft;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_P_Label = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_P_Label, FALSE);
	gwinSetFont(CH1_P_Label, dejavu_sans_10);
	gwinRedraw(CH1_P_Label);

	// Create label widget: CH2_Label
	wi.g.show = TRUE;
	wi.g.x = 40;
	wi.g.y = 220;
	wi.g.width = 280;
	wi.g.height = 20;
	wi.g.parent = ghContainerPage0;
	wi.text = "";
	wi.customDraw = gwinLabelDrawJustifiedLeft;
	wi.customParam = 0;
	wi.customStyle = &y;
	CH2_Label = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH2_Label, FALSE);
	gwinSetFont(CH2_Label, dejavu_sans_10);
	gwinRedraw(CH2_Label);

	// Create list widget: V_Div_List
	wi.g.show = FALSE;
	wi.g.x = 70;
	wi.g.y = 30;
	wi.g.width = 50;
	wi.g.height = 70;
	wi.g.parent = ghContainerPage0;
	wi.text = "List1";
	wi.customDraw = gwinListDefaultDraw;
	wi.customParam = 0;
	wi.customStyle = &divc;
	V_Div_List = gwinListCreate(0, &wi, FALSE);
	gwinSetTag(V_Div_List,V_Div_List_ID);
	gwinListSetScroll(V_Div_List, scrollSmooth);
	gwinSetFont(V_Div_List, dejavu_sans_12);
	gwinRedraw(V_Div_List);
	gwinListAddItem(V_Div_List, "0.50V", FALSE);
	gwinListAddItem(V_Div_List, "0.25V", FALSE);
	gwinListAddItem(V_Div_List, "0.10V", FALSE);
	gwinListAddItem(V_Div_List, "0.05V", FALSE);

	gwinListSetSelected(V_Div_List, 0, FALSE);
	gwinListSetSelected(V_Div_List, 1, FALSE);
	gwinListSetSelected(V_Div_List, 2, FALSE);
	gwinListSetSelected(V_Div_List, 3, FALSE);

	// Create label widget: X_A_Label_Txt
	wi.g.show = TRUE;
	wi.g.x = 140;
	wi.g.y = 0;
	wi.g.width = 30;
	wi.g.height = 15;
	wi.g.parent = ghContainerPage0;
	wi.text = "0.000";
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	X_A_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(X_A_Label_Txt, FALSE);
	gwinSetFont(X_A_Label_Txt, dejavu_sans_10);
	gwinRedraw(X_A_Label_Txt);

	// Create label widget: X_B_Label_Txt
	wi.g.show = TRUE;
	wi.g.x = 140;
	wi.g.y = 15;
	wi.g.width = 30;
	wi.g.height = 15;
	wi.g.parent = ghContainerPage0;
	wi.text = "0.000";
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	X_B_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(X_B_Label_Txt, FALSE);
	gwinSetFont(X_B_Label_Txt, dejavu_sans_10);
	gwinRedraw(X_B_Label_Txt);

	// Create label widget: X_F_Label_Txt
	wi.g.show = TRUE;
	wi.g.x = 180;
	wi.g.y = 0;
	wi.g.width = 40;
	wi.g.height = 15;
	wi.g.parent = ghContainerPage0;
	wi.text = "0.000";
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	X_F_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(X_F_Label_Txt, FALSE);
	gwinSetFont(X_F_Label_Txt, dejavu_sans_10);
	gwinRedraw(X_F_Label_Txt);

	// Create label widget: X_AB_Label_Txt
	wi.g.show = TRUE;
	wi.g.x = 190;
	wi.g.y = 15;
	wi.g.width = 30;
	wi.g.height = 15;
	wi.g.parent = ghContainerPage0;
	wi.text = "0.000";
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	X_AB_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(X_AB_Label_Txt, FALSE);
	gwinSetFont(X_AB_Label_Txt, dejavu_sans_10);
	gwinRedraw(X_AB_Label_Txt);

	// Create label widget: Y_A_Label_Txt
	wi.g.show = TRUE;
	wi.g.x = 240;
	wi.g.y = 0;
	wi.g.width = 30;
	wi.g.height = 15;
	wi.g.parent = ghContainerPage0;
	wi.text = "0.000";
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &y;
	Y_A_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(Y_A_Label_Txt, FALSE);
	gwinSetFont(Y_A_Label_Txt, dejavu_sans_10);
	gwinRedraw(Y_A_Label_Txt);

	// Create label widget: Y_B_Label_Txt
	wi.g.show = TRUE;
	wi.g.x = 240;
	wi.g.y = 15;
	wi.g.width = 30;
	wi.g.height = 15;
	wi.g.parent = ghContainerPage0;
	wi.text = "0.000";
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &y;
	Y_B_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(Y_B_Label_Txt, FALSE);
	gwinSetFont(Y_B_Label_Txt, dejavu_sans_10);
	gwinRedraw(Y_B_Label_Txt);

	// Create label widget: Y_AB_Label_Txt
	wi.g.show = TRUE;
	wi.g.x = 290;
	wi.g.y = 0;
	wi.g.width = 30;
	wi.g.height = 15;
	wi.g.parent = ghContainerPage0;
	wi.text = "0.000";
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &y;
	Y_AB_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(Y_AB_Label_Txt, FALSE);
	gwinSetFont(Y_AB_Label_Txt, dejavu_sans_10);
	gwinRedraw(Y_AB_Label_Txt);

	// Create label widget: Y_Trg_Button
	wi.g.show = TRUE;
	wi.g.x = 290;
	wi.g.y = 15;
	wi.g.width = 30;
	wi.g.height = 15;
	wi.g.parent = ghContainerPage0;
	wi.text = "0.000";
	wi.customDraw = gwinButtonDraw_Normal;
	wi.customParam = 0;
	wi.customStyle = &divc;
	Y_Trg_Button = gwinButtonCreate(0, &wi);
	gwinSetTag(Y_Trg_Button,Y_Trg_Button_ID);
	gwinSetFont(Y_Trg_Button ,dejavu_sans_10);
	gwinRedraw(Y_Trg_Button);







	// Create label widget: CH1_RMS_Label_Txt
	char rms_value[16];
	float2str(findRMS(),rms_value,3);
	wi.g.show = TRUE;
	wi.g.x = 65;
	wi.g.y = 200;
	wi.g.width = 45;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = rms_value;
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_RMS_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_RMS_Label_Txt, FALSE);
	gwinSetFont(CH1_RMS_Label_Txt, dejavu_sans_10);
	gwinRedraw(CH1_RMS_Label_Txt);

	// Create label widget: CH1_SF_Label_Txt
	wi.g.show = TRUE;
	wi.g.x = 60;
	wi.g.y = 210;
	wi.g.width = 50;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = "0.000";
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_SF_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_SF_Label_Txt, FALSE);
	gwinSetFont(CH1_SF_Label_Txt, dejavu_sans_10);
	gwinRedraw(CH1_SF_Label_Txt);

	// Create label widget: CH1_Max_Label_Txt
	char max_value[16];
	float2str(findMax(),max_value,3);
	wi.g.show = TRUE;
	wi.g.x = 135;
	wi.g.y = 200;
	wi.g.width = 45;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = max_value;
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_Max_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_Max_Label_Txt, FALSE);
	gwinSetFont(CH1_Max_Label_Txt, dejavu_sans_10);
	gwinRedraw(CH1_Max_Label_Txt);

