YZ-Qiu/Scope_STM32/Src/ui/gui.c
	// Create label widget: CH1_Min_Label_Txt
	char min_value[16];
	float2str(findMin(),min_value,3);
	wi.g.show = TRUE;
	wi.g.x = 135;
	wi.g.y = 210;
	wi.g.width = 45;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = min_value;
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_Min_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_Min_Label_Txt, FALSE);
	gwinSetFont(CH1_Min_Label_Txt, dejavu_sans_10);
	gwinRedraw(CH1_Min_Label_Txt);

	// Create label widget: CH1_PP_Label_Txt
	char pp_value[16];
	float2str(findP2P(),pp_value,3);
	wi.g.show = TRUE;
	wi.g.x = 195;
	wi.g.y = 200;
	wi.g.width = 55;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = pp_value;
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_PP_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_PP_Label_Txt, FALSE);
	gwinSetFont(CH1_PP_Label_Txt, dejavu_sans_10);
	gwinRedraw(CH1_PP_Label_Txt);

	// Create label widget: CH1_Pk_Label_Txt
	char pk_value[16];
	float2str(findPk(),pk_value,3);
	wi.g.show = TRUE;
	wi.g.x = 195;
	wi.g.y = 210;
	wi.g.width = 55;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = pk_value;
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_Pk_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_Pk_Label_Txt, FALSE);
	gwinSetFont(CH1_Pk_Label_Txt, dejavu_sans_10);
	gwinRedraw(CH1_Pk_Label_Txt);

	// Create label widget: CH1_RT_Label_Txt
	wi.g.show = TRUE;
	wi.g.x = 265;
	wi.g.y = 200;
	wi.g.width = 55;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = "0.000";
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_RT_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_RT_Label_Txt, FALSE);
	gwinSetFont(CH1_RT_Label_Txt, dejavu_sans_10);
	gwinRedraw(CH1_RT_Label_Txt);

	// Create label widget: CH1_P_Label_Txt
	wi.g.show = TRUE;
	wi.g.x = 260;
	wi.g.y = 210;
	wi.g.width = 60;
	wi.g.height = 10;
	wi.g.parent = ghContainerPage0;
	wi.text = "0.000";
	wi.customDraw = gwinLabelDrawJustifiedRight;
	wi.customParam = 0;
	wi.customStyle = &x;
	CH1_P_Label_Txt = gwinLabelCreate(0, &wi);
	gwinLabelSetBorder(CH1_P_Label_Txt, FALSE);
	gwinSetFont(CH1_P_Label_Txt, dejavu_sans_10);
	gwinRedraw(CH1_P_Label_Txt);

	// Create list widget: T_Div_List
	wi.g.show = FALSE;
	wi.g.x = 30;
	wi.g.y = 30;
	wi.g.width = 50;
	wi.g.height = 70;
	wi.g.parent = ghContainerPage0;
	wi.text = "List1";
	wi.customDraw = gwinListDefaultDraw;
	wi.customParam = 0;
	wi.customStyle = &divc;
	T_Div_List = gwinListCreate(0, &wi, FALSE);
	gwinSetTag(T_Div_List,T_Div_List_ID);
	gwinListSetScroll(T_Div_List, scrollSmooth);
	gwinSetFont(T_Div_List, dejavu_sans_12);
	gwinRedraw(T_Div_List);
    gwinListAddItem(T_Div_List, "10us", TRUE);
    gwinListAddItem(T_Div_List, "25us", TRUE);
    gwinListAddItem(T_Div_List, "50us", TRUE);
    gwinListAddItem(T_Div_List, "100us", TRUE);
    gwinListAddItem(T_Div_List, "500us", TRUE);
    gwinListAddItem(T_Div_List, "1ms", TRUE);
	gwinListSetSelected(T_Div_List, 0, FALSE);
	gwinListSetSelected(T_Div_List, 1, FALSE);
	gwinListSetSelected(T_Div_List, 2, FALSE);
	gwinListSetSelected(T_Div_List, 3, FALSE);
	gwinListSetSelected(T_Div_List, 4, FALSE);
	gwinListSetSelected(T_Div_List, 5, FALSE);




}


void guiShowPage(unsigned pageIndex)
{
	// Hide all pages
	gwinHide(ghContainerPage0);

	// Show page selected page
	switch (pageIndex) {
	case 0:
		gwinShow(ghContainerPage0);
		break;

	default:
		break;
	}
}


static uint16_t ADC_buffer[2][320]={};
void displayADC(void)
{
	/*
		int i;
 	for(i = 0; i < 320; i++) {
        gdispDrawPixel(i, 120+80*cos(2*M_PI*i/200),White);
    }
    */

  uint16_t ADC_val=0;
  uint16_t smp_cnt = 0;
  MX_ADC1_Init();
  HAL_ADC_Start_DMA(&hadc1, (uint32_t*)&ADC_val,1);
  HAL_ADC_Start(&hadc1);
  uint16_t buf_i=0;
  //Assume 42MHz sample rate---> down scale to 420Hz
  char str[32];
  int use_buf=0,i;
  while(1)
  {

    ADC_val = HAL_ADC_GetValue(&hadc1);
    smp_cnt++;
    if(smp_cnt > 99){
      if(buf_i==320)
      {
        use_buf = !use_buf;
        for(i=0;i<(320-1);i++)
        {
          LCD_DrawLine( i,ADC_buffer[use_buf][i]+60,i,ADC_buffer[use_buf][i+1]+60,Black);
        }
        use_buf = !use_buf;
        
        for(i=0;i<(320-1);i++)
        {
          LCD_DrawLine( i,ADC_buffer[use_buf][i]+60,i,ADC_buffer[use_buf][i+1]+60,Green);
        }
        buf_i=0;
        use_buf = !use_buf;
      }
      ADC_buffer[use_buf][buf_i] = (ADC_val)*240/4096;
      buf_i++;
      smp_cnt = 0;
    }
  }
  
}


float findMax()
{
	int i;
	float max=0;
	for(i=0;i<320;i++)
		max = ((max<ADC_buffer[0][i])?ADC_buffer[0][i]:max);
	return max;
}

float findMin()
{
	int i;
	float min=0;
	for(i=0;i<320;i++)
		min = ((min>ADC_buffer[0][i])?ADC_buffer[0][i]:min);
	return min;
}

float findP2P()
{
	return findMax()-findMin();
}

float findPk()
{
	return findP2P()/2;
}

float findRMS()
{
	int i;
	float RMS=0;
	for(i=0;i<320;i++)
		RMS += (ADC_buffer[0][i]*ADC_buffer[0][i]);
	return RMS;
}

void guiCreate(void)
{
	GWidgetInit wi;

	// Prepare fonts
	dejavu_sans_16 = gdispOpenFont("DejaVuSans16");
	dejavu_sans_12 = gdispOpenFont("DejaVuSans12");
	dejavu_sans_10 = gdispOpenFont("DejaVuSans10");

	// Prepare images

	// GWIN settings
	gwinWidgetClearInit(&wi);
	gwinSetDefaultFont(dejavu_sans_16);
	gwinSetDefaultStyle(&white, FALSE);
	gwinSetDefaultColor(black_studio);
	gwinSetDefaultBgColor(black_studio);

	// Create all the display pages
	createPagePage0();

	// Select the default display page


	guiShowPage(0);



	//draw ADC data



/*
   float val=0;
    char str[16];
     for(;;)
  {

    val+=0.001;
   // sprintf(str, "%.3f", val);
  //	snprintf(str, sizeof(str), "%.3f", val);

  float2str(ADC_val,str,3);

   LCD_print(10, 30, str);
    osDelay(300);
    LCD_printColor(10, 30, str, Black);
   // LCD_Clear(Black);
  }
*/
	


/*
	int i;
 	for(i = 0; i < 320; i++) {
        gdispDrawPixel(i, 120+80*cos(2*M_PI*i/200),White);
    }
*/
 
