YZ-Qiu/Scope_STM32/Src/ui/gui.c
}

GHandle *opened_gh=NULL;

inline void btn_event(uint16_t tag)
{

	switch(tag)
	{
		case T_Div_Button_ID:
			if(gwinGetTag(*opened_gh) == V_Div_List_ID)
				gwinSetVisible( V_Div_List,FALSE);
			gwinSetVisible(T_Div_List, TRUE);
			opened_gh = &T_Div_List;
		break;
		case V_Div_Button_ID:
			if(gwinGetTag(*opened_gh) == T_Div_List_ID)
				gwinSetVisible( T_Div_List,FALSE);
			gwinSetVisible(V_Div_List, TRUE);
			opened_gh = &V_Div_List;
		break;	
		case Y_Trg_Button_ID:
			opened_gh = &Y_Trg_Button;
			drawDotLineHV(0, Trg_Y_val, 320, Trg_Y_val, Red);
		break;
	}
}
//Set text if select item
inline void lst_event(GHandle gh,uint16_t tag,GEvent* pe)
{
	switch(tag)
	{
		case T_Div_List_ID:
			gwinSetText(T_Div_Label,gwinListItemGetText(gh,((GEventGWinList *)pe)->item),TRUE);	
		break;
		case V_Div_List_ID:
			gwinSetText(V_Div_Label,gwinListItemGetText(gh,((GEventGWinList *)pe)->item),TRUE);		
		break;
			
	}
}


void guiEventLoop(void)
{
	//Setup code
	GEvent* pe;
	GHandle gh;
	GSourceHandle gs;	//for listen mouse event 
	GEventMouse     *pem;
	uint16_t tag;

	gs = ginputGetMouse(0);//for listen mouse event 
  	geventAttachSource(&glistener, gs, GLISTEN_MOUSEDOWNMOVES|GLISTEN_MOUSEMETA);
	//Inf 
	while (1) 
	{
		// Get an event
		//stuck here until event is received
		
		pe = geventEventWait(&glistener, TIME_INFINITE);
		switch (pe->type) 
		{
			case GEVENT_GWIN_BUTTON:
				tag= gwinGetTag(((GEventGWinButton *)pe)->gwin);
				btn_event(tag);
			break;
			case GEVENT_GWIN_LIST:
				gh = ((GEventGWinList *)pe)->gwin;
				tag= gwinGetTag(gh);

				if(gwinListItemIsSelected(gh, ((GEventGWinList *)pe)->item))
				{
					lst_event(gh,tag,pe);
					gwinSetVisible(gh, FALSE);
				}
			break;
			default:
				if(opened_gh==NULL)
					break;
				tag = gwinGetTag(*opened_gh);
				switch(tag)
				{
					case Y_Trg_Button_ID:
						pem = (GEventMouse *)pe;
					 	if(pem->y >TOP_UI_Y && pem->y< DOWN_UI_Y)
					 	{
							//Clean previous draw
							drawDotLineHV(0, Trg_Y_val, 320, Trg_Y_val, Black);
							Trg_Y_val = pem->y;
							drawDotLineHV(0, Trg_Y_val, 320, Trg_Y_val, Red);
					 	}
					break;
					case V_Div_List_ID:
					case T_Div_List_ID:
						if(gwinListItemIsSelected(*opened_gh, ((GEventGWinList *)pe)->item))
						{
							lst_event(*opened_gh,tag,pe);
							gwinSetVisible(*opened_gh, FALSE);
							opened_gh = NULL;
						}
					break;
						
				}
				
			break;

		}

	}
}